# Como criar e manipular bancos de dados SQL com Python

Acessar p√°gina do artigo no [Copiar o link e colar no navegador](obsidian://open?vault=Database&file=%F0%9F%97%82%EF%B8%8F%20Python%2FComo%20criar%20e%20manipular%20bancos%20de%20dados%20SQL%20com%20Python)

### 1. Importar as bibliotecas

In [1]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

Importamos a fun√ß√£o **Error** para ter acesso f√°cil a ela nas fun√ß√µes do tutorial

### 2. Conectando ao MySQL server

A essa altura √© preciso ter o Mysql Community Server instalado e configurado no sistema. Agora, iremos escrever um c√≥digo em Python que nos permita estabelecer uma conex√£o com esse servidor.

In [5]:
def create_server_connection(host_name, user_name, user_password): # Na primeira linha, damos um nome a fun√ß√£o (create_server_connection) e aos seus argumentos (host_name, user_name e user_password).
    connection = None # Na segunda linha, encerramos quaisquer conex√µes existentes para que o servidor n√£o fique confuso com v√°rias conex√µes abertas
    try: # Em seguida, usamos o bloco try-except do Python, para lidar com poss√≠veis erros.
        connection = mysql.connector.connect( # A primeira parte tenta criar uma conex√£o com o servidor usando o m√©todo mysql.connector.connect e os detalhes especificados pelo usu√°rios nos argumentos da fun√ß√£o.
            host=host_name,
            user=user_name,
            passwd=user_password
        )
        print("MySQL Database connection successful") # Se funcionar, a fun√ß√£o imprime uma pequena mensagem de sucesso 
    except Error as err: # J√° o bloco except imprime o erro que o MySQL retorna se, houver um erro.
        print(f"Error: '{err}'") # Por fim, se a conex√£o for bem sucedida, a fun√ß√£o retornar√° um objeto de conex√£o.

    return connection # Na pr√°tica, atribu√≠mos o resultado dessa fun√ß√£o a uma vari√°vel, que ent√£o se torna o nosso objeto de conex√£o. Podemos, depois disso, aplicar outros m√©todos, como o cursor, ao objeto e criar outros objetos √∫teis. 

pw = "root" # IMPORTANT! Put your MySQL Terminal password here.
db = "school" # This is the name of the database we will create in the next step - call it whatever you like.

connection = create_server_connection("172.17.0.2", "root", pw)

MySQL Database connection successful

Essa √© uma fun√ß√£o para se conectar ao MySQL Server. 

√â uma boa pr√°tica a cria√ß√£o de uma fun√ß√£o para tornar reutiliz√°vel um c√≥digo como esse, permitindo que ele seja utilizado repetidas vezes com o m√≠nimo de esfor√ßo. Uma vez criado, voc√™ poder√° reutiliz√°-lo em todos os seus projetos futuros e o seu ‚Äúeu do futuro‚Äù ser√° grato!

Vamos revisar o c√≥digo, linha por linha, para entendermos o que est√° acontecendo aqui:

Na primeira linha, damos um nome √† fun√ß√£o (create\_server\_connection) e aos seus argumentos (host\_name, user\_name e user\_password).

Na linha seguinte, encerramos quaisquer conex√µes existentes para que o servidor n√£o fique confuso com v√°rias conex√µes abertas.

Em seguida, usamos um  [bloco try-except](https://www.w3schools.com/python/python_try_except.asp) (texto em ingl√™s) do Python para lidar com poss√≠veis erros. A primeira parte tenta criar uma conex√£o com o servidor usando o [m√©todo mysql.connector.connect()](https://dev.mysql.com/doc/connector-python/en/connector-python-api-mysql-connector-connect.html) (texto em ingl√™s) e os detalhes especificados pelo usu√°rio nos argumentos da fun√ß√£o. Se isso funcionar, a fun√ß√£o imprime uma pequena mensagem de sucesso.

O c√≥digo referente ao bloco except imprime o erro que o MySQL Server retorna se, infelizmente, houver um erro.

Por fim, se a conex√£o for bem-sucedida, a fun√ß√£o retornar√° um [objeto de conex√£o](https://dev.mysql.com/doc/connector-python/en/connector-python-example-connecting.html) (texto em ingl√™s).

Na pr√°tica, atribu√≠mos o resultado dessa fun√ß√£o a uma vari√°vel, que ent√£o se torna o nosso objeto de conex√£o. Podemos, depois disso, aplicar outros m√©todos, como o [cursor](https://dev.mysql.com/doc/connector-python/en/connector-python-api-mysqlcursor.html) (texto em ingl√™s), a ele e criar outros objetos √∫teis.

### 3. Criando um banco de dados

Depois de estabelecer conex√£o, o pr√≥ximo passo √© criar um banco de dados no servidor. 

Faremos uma √∫nica vez, mas, j√° deixaremos uma fun√ß√£o pronta e reutiliz√°vel de modo que tenhamos um c√≥digo para utilizar em projetos futuros.

In [6]:
def create_database(connection, query): # Essa fun√ß√£o recebe dois argumentos: connection (nosso objeto de conex√£o) e query (um c√≥digo SQL que escreveremos na pr√≥xima etapa, para executar a query no servidor atrav√©s da conex√£o)
    cursor = connection.cursor() # Esse √© o m√©todo cursor do nosso objeto de conex√£o, para criar um objeto do tipo cursor (O MySQL usa o paradigma de programa√ß√£o orientada a objetos, portanto, h√° muitos objetos herdando propriedades do objeto pai)
    try:
        cursor.execute(query) # Este objeto cursor possui m√©todos como execute, executemany  (que usaremos nesse tutorial)
        print("Database created successfully")
    except Error as err:
        print(f"Error: '{err}'")

create_database_query = "CREATE DATABASE school" # Query para criar um novo banco de dados chamado "school"
create_database(connection, create_database_query) # Comando para executar a fun√ß√£o

Error: '1007 (HY000): Can't create database 'school'; database exists'

Essa fun√ß√£o recebe dois argumentos, connection (nosso objeto de conex√£o) e query (um c√≥digo SQL que escreveremos na pr√≥xima etapa). Ela executa a consulta no servidor atrav√©s da conex√£o.

Usamos o m√©todo [cursor](https://dev.mysql.com/doc/connector-python/en/connector-python-api-mysqlcursor.html) do nosso objeto de conex√£o para criar um objeto do tipo cursor (o MySQL Connector usa o [paradigma de programa√ß√£o orientado a objetos](https://www.freecodecamp.org/portuguese/news/como-explicar-conceitos-de-programacao-orientada-a-objetos-para-uma-crianca-de-6-anos/), portanto, h√° muitos objetos herdando propriedades de objetos pai).

Este objeto cursor possui m√©todos como [execute](https://dev.mysql.com/doc/connector-python/en/connector-python-api-mysqlcursor-execute.html), [executemany](https://dev.mysql.com/doc/connector-python/en/connector-python-api-mysqlcursor-executemany.html) (que usaremos neste tutorial - textos em ingl√™s) assim como v√°rios outros m√©todos √∫teis.

Se ajudar, podemos pensar que o objeto cursor d√° acesso ao cursor que fica piscando em um terminal do MySQL Server.

![image-148](https://www.freecodecamp.org/portuguese/news/content/images/2022/02/image-148.png)

√â disso que estamos falando.

Em seguida, definimos uma consulta para criar o banco de dados e executar a fun√ß√£o:

![image-149-1](https://www.freecodecamp.org/portuguese/news/content/images/2022/02/image-149-1.png)

Todos os c√≥digos SQL deste tutorial est√£o explicados [na minha s√©rie de tutoriais Introduction to SQL](https://towardsdatascience.com/tagged/sql-series) (Introdu√ß√£o ao SQL, em ingl√™s), e o c√≥digo completo est√° dispon√≠vel em um Jupyter Notebook neste [reposit√≥rio do GitHub](https://github.com/thecraigd/Python_SQL). Portanto, n√£o explicarei o que o c√≥digo SQL faz neste tutorial.

No entanto, esse √© talvez o c√≥digo SQL mais simples poss√≠vel. Se voc√™ pode ler em ingl√™s, provavelmente pode descobrir o que ele faz!

Executar a fun√ß√£o create\_database com os argumentos acima resulta na cria√ß√£o de um banco de dados chamado 'school' em nosso servidor.

O banco de dados se chama school pois ser√° implementado um banco de dados para uma escola de idiomas fict√≠cia. O diagrama entidade-relacionamento se encontra no Jupyter do GitHub.

### 4. Conectado ao banco de dados

Agora que criamos um banco de dados no MySQL Server, podemos modificar nossa fun√ß√£o create_server_connection para conectar diretamente a esse banco de dados.

Observe que √© poss√≠vel - comum, na verdade - ter v√°rios bancos de dados em um servidor MySQL, ent√£o queremos nos conectar sempre e automaticamente ao banco de dados em que estamos interessados.

Podemos fazer da seguinte maneira:

In [7]:
def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password,
            database=db_name # Agora, temos mais um argumento, que √© o nome do banco de dados
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")

    return connection

Essa √© exatamente a mesma fun√ß√£o, mas agora temos mais um argumento - o nome do banco de dados - que √© passado para o m√©todo connect()

üí° Para que serve o **Connect()**? 
 
- Para criar ou obter um objeto de conex√£o MySQL. Na sua forma mais simples, o m√©todo connect() ir√° abrir uma conex√£o com um servidor MySql e retornar um objeto MySQlConnection. Quando quaisquer argumentos de pool de conex√£o s√£o fornecidos, por exemplo pool_name ou pool_size, um pool √© criado ou um anteriormente criado √© usado para retornar um PooledMySQLConnection.
- Retornar MySQLConnection ou PooledMySQLConnection.

### 5. Criando uma fun√ß√£o para executar queries

A √∫ltima fun√ß√£o que criaremos (por enquanto) √© extremamente vital - uma fun√ß√£o de execu√ß√£o de query. Ela pegar√° nossas consultas SQL, armazenadas como strings do Python, e as passar√° para que o m√©todo cursor.execute() as execute no servidor.

In [8]:
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit() # M√©todo connection.commit para garantir que os comandos detalhados em nossas queries SQL sejam implementados.
        print("Query successful")
    except Error as err:
        print(f"Error: '{err}'")

Essa fun√ß√£o √© id√™ntica √† nossa fun√ß√£o create\_database, exceto por usar o m√©todo [connection.commit()](https://dev.mysql.com/doc/connector-python/en/connector-python-api-mysqlconnection-commit.html) para garantir que os comandos detalhados em nossas consultas SQL sejam implementados.

Essa fun√ß√£o ser√° nosso carro-chefe, que usaremos (junto com create\_db\_connection) para criar tabelas, estabelecer relacionamentos entre essas tabelas, preencher as tabelas com dados e atualizar e excluir registros em nosso banco de dados.

Se voc√™ for um especialista em SQL, essa fun√ß√£o permitir√° que voc√™ execute todos e quaisquer comandos e consultas complexas que voc√™ possa ter, diretamente de um script em Python. Ela pode ser uma ferramenta muito poderosa para gerenciar seus dados.

### 6. Criando tabelas

Agora, estamos prontos para executar comandos SQL no servidor e come√ßar a construir o banco de dados. A primeira coisa que queremos fazer √© criar as tabelas necess√°rias. 

Vamos come√ßar pela tabela Teacher:

In [9]:
# Assign our SQL command to a python variable using triple quotes to create a multi-line string
create_teacher_table = """
CREATE TABLE teacher (
  teacher_id INT PRIMARY KEY,
  first_name VARCHAR(40) NOT NULL,
  last_name VARCHAR(40) NOT NULL,
  language_1 VARCHAR(3) NOT NULL,
  language_2 VARCHAR(3),
  dob DATE,
  tax_id INT UNIQUE,
  phone_no VARCHAR(20)
  );
 """

connection = create_db_connection("172.17.0.2", "root", pw, db) # Connect to the Database
execute_query(connection, create_teacher_table) # Execute our defined query

MySQL Database connection successful
Query successful

Primeiro, atribu√≠mos nosso comando SQL (explicado em detalhes aqui) a uma vari√°vel com um nome apropriado, no exemplo, demos o nome de "create_teacher_table". 

Neste caso, usamos a [nota√ß√£o de aspas triplas do Python para definir strings que se estendem por m√∫ltiplas linhas](https://developers.google.com/edu/python/strings) (texto em ingl√™s) para armazenar nossa consulta SQL. Ent√£o, n√≥s a passamos para a fun√ß√£o execute\_query que a executar√°.

Observe que essa formata√ß√£o de v√°rias linhas √© puramente para facilitar a leitura do c√≥digo por humanos. Nem SQL nem Python 'se importam' se o comando SQL estiver distribu√≠do dessa maneira. Desde que a sintaxe esteja correta, ambas as linguagens a aceitar√£o.

Para o bem dos humanos que ler√£o seu c√≥digo (mesmo que seja apenas o voc√™ do futuro!), √© muito √∫til empregar essa formata√ß√£o para tornar o c√≥digo mais leg√≠vel e compreens√≠vel.

O mesmo vale para o uso de express√µes do SQL em LETRAS MAI√öSCULAS. Esta √© uma conven√ß√£o amplamente usada e que √© fortemente recomendada, mas o software real que executa o c√≥digo n√£o diferencia mai√∫sculas de min√∫sculas e tratar√° 'CREATE TABLE teacher' e 'create table teacher' como comandos id√™nticos.

![image-151](https://www.freecodecamp.org/portuguese/news/content/images/2022/02/image-151.png)

A execu√ß√£o deste c√≥digo retorna nossas mensagens de sucesso. Tamb√©m podemos verificar isso no client na linha de comando do MySQL Server:

![image-152](https://www.freecodecamp.org/portuguese/news/content/images/2022/02/image-152.png)

Excelente! Agora vamos criar as tabelas restantes.

### 7. Criando as tabelas restantes

In [11]:
create_client_table = """
CREATE TABLE client (
  client_id INT PRIMARY KEY,
  client_name VARCHAR(40) NOT NULL,
  address VARCHAR(60) NOT NULL,
  industry VARCHAR(20)
);
 """

create_participant_table = """
CREATE TABLE participant (
  participant_id INT PRIMARY KEY,
  first_name VARCHAR(40) NOT NULL,
  last_name VARCHAR(40) NOT NULL,
  phone_no VARCHAR(20),
  client INT
);
"""

create_course_table = """
CREATE TABLE course (
  course_id INT PRIMARY KEY,
  course_name VARCHAR(40) NOT NULL,
  language VARCHAR(3) NOT NULL,
  level VARCHAR(2),
  course_length_weeks INT,
  start_date DATE,
  in_school BOOLEAN,
  teacher INT,
  client INT
);
"""


connection = create_db_connection("172.17.0.2", "root", pw, db)
execute_query(connection, create_client_table)
execute_query(connection, create_participant_table)
execute_query(connection, create_course_table)

MySQL Database connection successful
Query successful
Query successful
Query successful

Esses comandos criar√£o as quatro tabelas necess√°rias para nossas quatro entidades.

Agora, vamos definir os relacionamentos entre elas e criar mais uma tabela para lidar com o relacionamento muitos-para-muitos entre as tabelas participant e course (participante e curso, em ingl√™s, respectivamente). Veja mais detalhes [aqui](https://towardsdatascience.com/designing-a-relational-database-and-creating-an-entity-relationship-diagram-89c1c19320b2) (texto em ingl√™s).

### 8. Definindo o relacionamento das chaves estrangeiras 

Agora, alterando as tabelas para criar relacionamentos de chave estrangeira (consulte a s√©rie de tutoriais SQL em Towards Data Science para obter informa√ß√µes sobre tudo isso) e criando nossa tabela final, takes_course

In [13]:
alter_participant = """
ALTER TABLE participant
ADD FOREIGN KEY(client)
REFERENCES client(client_id)
ON DELETE SET NULL;
"""

alter_course = """
ALTER TABLE course
ADD FOREIGN KEY(teacher)
REFERENCES teacher(teacher_id)
ON DELETE SET NULL;
"""

alter_course_again = """
ALTER TABLE course
ADD FOREIGN KEY(client)
REFERENCES client(client_id)
ON DELETE SET NULL;
"""

create_takescourse_table = """
CREATE TABLE takes_course (
  participant_id INT,
  course_id INT,
  PRIMARY KEY(participant_id, course_id),
  FOREIGN KEY(participant_id) REFERENCES participant(participant_id) ON DELETE CASCADE, -- it makes no sense to keep this rtelation when a participant or course is no longer in the system, hence why CASCADE this time
  FOREIGN KEY(course_id) REFERENCES course(course_id) ON DELETE CASCADE
);
"""

connection = create_db_connection("172.17.0.2", "root", pw, db)
execute_query(connection, alter_participant)
execute_query(connection, alter_course)
execute_query(connection, alter_course_again)
execute_query(connection, create_takescourse_table)

MySQL Database connection successful
Query successful
Query successful
Query successful
Query successful

Agora, nossas tabelas foram criadas, juntamente com as restri√ß√µes apropriadas e as rela√ß√µes entre chaves prim√°rias e chaves estrangeiras.

### 9. Preenchendo as tabelas

A pr√≥xima etapa √© adicionar alguns registros √†s tabelas. Novamente, usaremos a fun√ß√£o execute\_query para enviar nossos comandos SQL existentes ao servidor. Vamos come√ßar mais uma vez com a tabela Teacher.

Aqui, novamente atribu√≠mos uma string de v√°rias linhas com nosso comando SQL a uma vari√°vel e, em seguida, chamamos nossas fun√ß√µes create_db_connection e execute_query.

In [14]:
pop_teacher = """
INSERT INTO teacher VALUES
(1,  'James', 'Smith', 'ENG', NULL, '1985-04-20', 12345, '+491774553676'),
(2, 'Stefanie',  'Martin',  'FRA', NULL,  '1970-02-17', 23456, '+491234567890'), 
(3, 'Steve', 'Wang',  'MAN', 'ENG', '1990-11-12', 34567, '+447840921333'),
(4, 'Friederike',  'M√ºller-Rossi', 'DEU', 'ITA', '1987-07-07',  45678, '+492345678901'),
(5, 'Isobel', 'Ivanova', 'RUS', 'ENG', '1963-05-30',  56789, '+491772635467'),
(6, 'Niamh', 'Murphy', 'ENG', 'IRI', '1995-09-08',  67890, '+491231231232');
"""

connection = create_db_connection("172.17.0.2", "root", pw, db)
execute_query(connection, pop_teacher)

MySQL Database connection successful
Query successful

Agora, vamos checar no terminal do MySQL se funcionou.

In [ ]:
SELECT *
FROM teacher;

### 10. Populando as tabelas restantes

In [16]:
pop_client = """
INSERT INTO client VALUES
(101, 'Big Business Federation', '123 Falschungstra√üe, 10999 Berlin', 'NGO'),
(102, 'eCommerce GmbH', '27 Ersatz Allee, 10317 Berlin', 'Retail'),
(103, 'AutoMaker AG',  '20 K√ºnstlichstra√üe, 10023 Berlin', 'Auto'),
(104, 'Banko Bank',  '12 Betrugstra√üe, 12345 Berlin', 'Banking'),
(105, 'WeMoveIt GmbH', '138 Arglistweg, 10065 Berlin', 'Logistics');
"""

pop_participant = """
INSERT INTO participant VALUES
(101, 'Marina', 'Berg','491635558182', 101),
(102, 'Andrea', 'Duerr', '49159555740', 101),
(103, 'Philipp', 'Probst',  '49155555692', 102),
(104, 'Ren√©',  'Brandt',  '4916355546',  102),
(105, 'Susanne', 'Shuster', '49155555779', 102),
(106, 'Christian', 'Schreiner', '49162555375', 101),
(107, 'Harry', 'Kim', '49177555633', 101),
(108, 'Jan', 'Nowak', '49151555824', 101),
(109, 'Pablo', 'Garcia',  '49162555176', 101),
(110, 'Melanie', 'Dreschler', '49151555527', 103),
(111, 'Dieter', 'Durr',  '49178555311', 103),
(112, 'Max', 'Mustermann', '49152555195', 104),
(113, 'Maxine', 'Mustermann', '49177555355', 104),
(114, 'Heiko', 'Fleischer', '49155555581', 105);
"""

pop_course = """
INSERT INTO course VALUES
(12, 'English for Logistics', 'ENG', 'A1', 10, '2020-02-01', TRUE,  1, 105),
(13, 'Beginner English', 'ENG', 'A2', 40, '2019-11-12',  FALSE, 6, 101),
(14, 'Intermediate English', 'ENG', 'B2', 40, '2019-11-12', FALSE, 6, 101),
(15, 'Advanced English', 'ENG', 'C1', 40, '2019-11-12', FALSE, 6, 101),
(16, 'Mandarin f√ºr Autoindustrie', 'MAN', 'B1', 15, '2020-01-15', TRUE, 3, 103),
(17, 'Fran√ßais interm√©diaire', 'FRA', 'B1',  18, '2020-04-03', FALSE, 2, 101),
(18, 'Deutsch f√ºr Anf√§nger', 'DEU', 'A2', 8, '2020-02-14', TRUE, 4, 102),
(19, 'Intermediate English', 'ENG', 'B2', 10, '2020-03-29', FALSE, 1, 104),
(20, 'Fortgeschrittenes Russisch', 'RUS', 'C1',  4, '2020-04-08',  FALSE, 5, 103);
"""

pop_takescourse = """
INSERT INTO takes_course VALUES
(101, 15),
(101, 17),
(102, 17),
(103, 18),
(104, 18),
(105, 18),
(106, 13),
(107, 13),
(108, 13),
(109, 14),
(109, 15),
(110, 16),
(110, 20),
(111, 16),
(114, 12),
(112, 19),
(113, 19);
"""

connection = create_db_connection("172.17.0.2", "root", pw, db)
execute_query(connection, pop_client)
execute_query(connection, pop_participant)
execute_query(connection, pop_course)
execute_query(connection, pop_takescourse)

MySQL Database connection successful
Query successful
Query successful
Query successful
Query successful

Acabamos de criar um banco de dados completo com rela√ß√µes, restri√ß√µes e registros no MySQL, usando apenas comandos em Python.

Fizemos isso passo a passo para que o processo fosse compreens√≠vel. Mas a esta altura voc√™ j√° deve ter percebido que todos esses comandos podem facilmente ser inclu√≠dos em um script em Python e executados em um √∫nico comando no terminal.

## 11. Lendo os dados
### 11.1 Definindo a fun√ß√£o de leitura dos dados

gora, temos um banco de dados funcional com o qual podemos trabalhar. Como analista de dados, √© prov√°vel que voc√™ entre em contato com bancos de dados existentes nas organiza√ß√µes em que trabalha. Ser√° muito √∫til saber como extrair dados desses bancos de dados para que possam ser alimentados em seu pipeline de dados em Python. √â nisso que vamos trabalhar a seguir.

Para isso, precisaremos de mais uma fun√ß√£o, desta vez, usando [cursor.fetchall()](https://dev.mysql.com/doc/connector-python/en/connector-python-api-mysqlcursor-fetchall.html) em vez de [cursor.commit()](https://dev.mysql.com/doc/connector-python/en/connector-python-api-mysqlconnection-commit.html) (textos das duas fun√ß√µes em ingl√™s). Com esta fun√ß√£o, leremos dados do banco de dados sem fazer nenhuma altera√ß√£o.

In [17]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall() # Em vez de usar o cursor.commit(), vamos usar o cursor.fetchall(). Com essa fun√ß√£o, leremos os dados do banco sem fazer nenhuma altera√ß√£o. 
        return result
    except Error as err:
        print(f"Error: '{err}'")

Novamente, vamos implementar isso de uma maneira muito semelhante ao execute_query. Vamos testar com uma consulta simples para ver como funciona.

In [18]:
q1 = """
SELECT *
FROM teacher;
"""

connection = create_db_connection("172.17.0.2", "root", pw, db)
results = read_query(connection, q1)

for result in results:
  print(result)

MySQL Database connection successful
(1, 'James', 'Smith', 'ENG', None, datetime.date(1985, 4, 20), 12345, '+491774553676')
(2, 'Stefanie', 'Martin', 'FRA', None, datetime.date(1970, 2, 17), 23456, '+491234567890')
(3, 'Steve', 'Wang', 'MAN', 'ENG', datetime.date(1990, 11, 12), 34567, '+447840921333')
(4, 'Friederike', 'M√ºller-Rossi', 'DEU', 'ITA', datetime.date(1987, 7, 7), 45678, '+492345678901')
(5, 'Isobel', 'Ivanova', 'RUS', 'ENG', datetime.date(1963, 5, 30), 56789, '+491772635467')
(6, 'Niamh', 'Murphy', 'ENG', 'IRI', datetime.date(1995, 9, 8), 67890, '+491231231232')

Exatamente o que est√°vamos esperando. A fun√ß√£o tamb√©m funciona com queries mais complexas, como essa abaixo, envolvendo JOIN entre as tabelas de course e client (curso e cliente, em ingl√™s, respectivamente) e mais algumas queries para testarmos.

In [20]:
q2 = """
SELECT last_name, dob
FROM teacher;
"""

connection = create_db_connection("172.17.0.2", "root", pw, db)
results = read_query(connection, q2)

for result in results:
  print(result)

MySQL Database connection successful
('Smith', datetime.date(1985, 4, 20))
('Martin', datetime.date(1970, 2, 17))
('Wang', datetime.date(1990, 11, 12))
('M√ºller-Rossi', datetime.date(1987, 7, 7))
('Ivanova', datetime.date(1963, 5, 30))
('Murphy', datetime.date(1995, 9, 8))

In [21]:
q3 = """
SELECT *
FROM course
WHERE language = 'ENG'
ORDER BY start_date DESC;
"""

connection = create_db_connection("172.17.0.2", "root", pw, db)
results = read_query(connection, q3)

for result in results:
  print(result)

MySQL Database connection successful
(19, 'Intermediate English', 'ENG', 'B2', 10, datetime.date(2020, 3, 29), 0, 1, 104)
(12, 'English for Logistics', 'ENG', 'A1', 10, datetime.date(2020, 2, 1), 1, 1, 105)
(13, 'Beginner English', 'ENG', 'A2', 40, datetime.date(2019, 11, 12), 0, 6, 101)
(14, 'Intermediate English', 'ENG', 'B2', 40, datetime.date(2019, 11, 12), 0, 6, 101)
(15, 'Advanced English', 'ENG', 'C1', 40, datetime.date(2019, 11, 12), 0, 6, 101)

In [22]:
q4 = """
SELECT first_name, last_name, phone_no
FROM teacher
WHERE dob < '1990-01-01';
"""

connection = create_db_connection("172.17.0.2", "root", pw, db)
results = read_query(connection, q4)

for result in results:
  print(result)

MySQL Database connection successful
('James', 'Smith', '+491774553676')
('Stefanie', 'Martin', '+491234567890')
('Friederike', 'M√ºller-Rossi', '+492345678901')
('Isobel', 'Ivanova', '+491772635467')

In [23]:
q5 = """
SELECT course.course_id, course.course_name, course.language, client.client_name, client.address
FROM course
JOIN client
ON course.client = client.client_id
WHERE course.in_school = FALSE;
"""

connection = create_db_connection("172.17.0.2", "root", pw, db)
results = read_query(connection, q5)

for result in results:
  print(result)

MySQL Database connection successful
(13, 'Beginner English', 'ENG', 'Big Business Federation', '123 Falschungstra√üe, 10999 Berlin')
(14, 'Intermediate English', 'ENG', 'Big Business Federation', '123 Falschungstra√üe, 10999 Berlin')
(15, 'Advanced English', 'ENG', 'Big Business Federation', '123 Falschungstra√üe, 10999 Berlin')
(17, 'Fran√ßais interm√©diaire', 'FRA', 'Big Business Federation', '123 Falschungstra√üe, 10999 Berlin')
(19, 'Intermediate English', 'ENG', 'Banko Bank', '12 Betrugstra√üe, 12345 Berlin')
(20, 'Fortgeschrittenes Russisch', 'RUS', 'AutoMaker AG', '20 K√ºnstlichstra√üe, 10023 Berlin')

Muito bom.

Para nossos pipelines de dados e fluxos de trabalho em Python, podemos querer obter esses resultados em formatos diferentes para torn√°-los mais √∫teis ou prontos para manipula√ß√£o.

Vamos ver alguns exemplos para entender como podemos fazer isso.

### Formatando resultados em formato de lista

Agora podemos atribuir os resultados a uma lista, para usar mais em nossos aplicativos ou scripts python.

O c√≥digo a seguir retorna os resultados de nossa consulta como uma lista de tuplas.

In [25]:
#Initialise empty list
from_db = []

# Loop over the results and append them into our list, different styles

# Returns a list of tuples
for result in results:
  result = result
  from_db.append(result)
    
print(from_db)

[(13, 'Beginner English', 'ENG', 'Big Business Federation', '123 Falschungstra√üe, 10999 Berlin'), (14, 'Intermediate English', 'ENG', 'Big Business Federation', '123 Falschungstra√üe, 10999 Berlin'), (15, 'Advanced English', 'ENG', 'Big Business Federation', '123 Falschungstra√üe, 10999 Berlin'), (17, 'Fran√ßais interm√©diaire', 'FRA', 'Big Business Federation', '123 Falschungstra√üe, 10999 Berlin'), (19, 'Intermediate English', 'ENG', 'Banko Bank', '12 Betrugstra√üe, 12345 Berlin'), (20, 'Fortgeschrittenes Russisch', 'RUS', 'AutoMaker AG', '20 K√ºnstlichstra√üe, 10023 Berlin')]

### Formatando o resultado em uma lista de listas

In [26]:
# Retorna uma lista de listas
from_db = []

for result in results:
  result = list(result)
  from_db.append(result)

print(from_db)

[[13, 'Beginner English', 'ENG', 'Big Business Federation', '123 Falschungstra√üe, 10999 Berlin'], [14, 'Intermediate English', 'ENG', 'Big Business Federation', '123 Falschungstra√üe, 10999 Berlin'], [15, 'Advanced English', 'ENG', 'Big Business Federation', '123 Falschungstra√üe, 10999 Berlin'], [17, 'Fran√ßais interm√©diaire', 'FRA', 'Big Business Federation', '123 Falschungstra√üe, 10999 Berlin'], [19, 'Intermediate English', 'ENG', 'Banko Bank', '12 Betrugstra√üe, 12345 Berlin'], [20, 'Fortgeschrittenes Russisch', 'RUS', 'AutoMaker AG', '20 K√ºnstlichstra√üe, 10023 Berlin']]

### Formatando o resultado em um [DataFrame do Pandas](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html)

Para os analistas de dados usando Python, o [pandas](https://pandas.pydata.org/pandas-docs/stable/index.html) (texto em ingl√™s) √© o nosso velho amigo, belo e confi√°vel. √â muito simples converter a sa√≠da do nosso banco de dados em um DataFrame. A partir da√≠, as possibilidades s√£o infinitas!

In [27]:
# Retorna uma lista de listas e cria um DataFrame do Pandas
from_db = []

for result in results:
  result = list(result)
  from_db.append(result)


columns = ["course_id", "course_name", "language", "client_name", "address"]
df = pd.DataFrame(from_db, columns=columns)

display(df)

,course_id,course_name,language,client_name,address
0,13,Beginner English,ENG,Big Business Federation,"123 Falschungstra√üe, 10999 Berlin"
1,14,Intermediate English,ENG,Big Business Federation,"123 Falschungstra√üe, 10999 Berlin"
2,15,Advanced English,ENG,Big Business Federation,"123 Falschungstra√üe, 10999 Berlin"
3,17,Fran√ßais interm√©diaire,FRA,Big Business Federation,"123 Falschungstra√üe, 10999 Berlin"
4,19,Intermediate English,ENG,Banko Bank,"12 Betrugstra√üe, 12345 Berlin"
5,20,Fortgeschrittenes Russisch,RUS,AutoMaker AG,"20 K√ºnstlichstra√üe, 10023 Berlin"

Espero que possa ver as possibilidades se desdobrando diante de voc√™. Com apenas algumas linhas de c√≥digo, podemos extrair facilmente todos os dados que podemos manipular dos bancos de dados relacionais em que eles residem e traz√™-los para nossos pipelines de an√°lise de dados de √∫ltima gera√ß√£o. Isso √© algo realmente √∫til.

## Atualizando registros

Quando mantemos um banco de dados, √†s vezes precisaremos fazer altera√ß√µes nos registros existentes. Nesta se√ß√£o, veremos como fazer isso.

Digamos que a nossa empresa fict√≠cia seja notificada de que um de seus clientes existentes, a Big Business Federation, est√° mudando de escrit√≥rio para 23 Fingiertweg, 14534 Berlin. Nesse caso, o administrador do banco de dados (n√≥s!) precisar√° fazer algumas altera√ß√µes.

Felizmente, podemos fazer isso com nossa fun√ß√£o execute\_query junto com a instru√ß√£o [UPDATE](https://dev.mysql.com/doc/refman/8.0/en/update.html) (texto em ingl√™s) do SQL.

### Atualizando o endere√ßo de um cliente

In [28]:
update = """
UPDATE client 
SET address = '23 Fingiertweg, 14534 Berlin' 
WHERE client_id = 101;
"""

connection = create_db_connection("172.17.0.2", "root", pw, db)
execute_query(connection, update)

MySQL Database connection successful
Query successful

Note que a cl√°usula WHERE √© muito importante. Se executarmos esse comando sem a cl√°usula WHERE, todos os endere√ßos de todos os registros em nossa tabela Client ser√£o atualizados para 23 Fingiertweg. N√£o √© exatamente isso que queremos fazer.

Observe tamb√©m que usamos "WHERE client_id = 101" na consulta UPDATE. Tamb√©m seria poss√≠vel usar "WHERE client_name = 'Big Business Federation'" ou "WHERE address = '123 Falschungstra√üe, 10999 Berlin'" ou mesmo "WHERE address LIKE '%Falschung%'".

O importante √© que a cl√°usula WHERE nos permite identificar exclusivamente o registro (ou registros) que queremos atualizar.

Agora, precisamos conferir a atualiza√ß√£o:

In [30]:
q1 = """
SELECT *
FROM client
WHERE client_id = 101;
"""

connection = create_db_connection("172.17.0.2", "root", pw, db)
results = read_query(connection, q1)

for result in results:
  print(result)

MySQL Database connection successful
(101, 'Big Business Federation', '23 Fingiertweg, 14534 Berlin', 'NGO')

## Deletando registros
### Deletando um curso

Tamb√©m √© poss√≠vel usar nossa fun√ß√£o execute\_query para excluir registros, usando [DELETE](https://dev.mysql.com/doc/refman/8.0/en/delete.html) (texto em ingl√™s).

Ao usar SQL com bancos de dados relacionais, precisamos ter cuidado ao usar o operador DELETE. Este n√£o √© o Windows. N√£o h√° um alerta dizendo "Tem certeza de que deseja excluir isso?" em uma janela de pop-up e n√£o h√° uma lixeira para a reciclagem. Uma vez que exclu√≠mos algo, esse algo realmente se foi.

Dito isso, n√≥s √†s vezes realmente precisamos apagar coisas. Ent√£o, vamos ver isso na pr√°tica, apagando um curso da nossa tabela Course.

Antes de mais nada, vamos nos lembrar dos cursos que temos.

![image-174](https://www.freecodecamp.org/portuguese/news/content/images/2022/02/image-174.png)

Digamos que o curso 20, 'Fortgeschrittenes Russisch' (que √© 'Russo avan√ßado' para voc√™ e para mim), est√° chegando ao fim. Ent√£o, precisamos remov√™-lo do nosso banco de dados.

A essa altura, voc√™ n√£o ficar√° surpreso com a forma como fazemos isso - salve o comando SQL como uma string e, em seguida, passe-o para a nossa fun√ß√£o execute\_query.

In [31]:
q1 = """
SELECT *
FROM course;
"""

connection = create_db_connection("172.17.0.2", "root", pw, db)
results = read_query(connection, q1)

from_db = []

for result in results:
  print(result)

MySQL Database connection successful
(12, 'English for Logistics', 'ENG', 'A1', 10, datetime.date(2020, 2, 1), 1, 1, 105)
(13, 'Beginner English', 'ENG', 'A2', 40, datetime.date(2019, 11, 12), 0, 6, 101)
(14, 'Intermediate English', 'ENG', 'B2', 40, datetime.date(2019, 11, 12), 0, 6, 101)
(15, 'Advanced English', 'ENG', 'C1', 40, datetime.date(2019, 11, 12), 0, 6, 101)
(16, 'Mandarin f√ºr Autoindustrie', 'MAN', 'B1', 15, datetime.date(2020, 1, 15), 1, 3, 103)
(17, 'Fran√ßais interm√©diaire', 'FRA', 'B1', 18, datetime.date(2020, 4, 3), 0, 2, 101)
(18, 'Deutsch f√ºr Anf√§nger', 'DEU', 'A2', 8, datetime.date(2020, 2, 14), 1, 4, 102)
(19, 'Intermediate English', 'ENG', 'B2', 10, datetime.date(2020, 3, 29), 0, 1, 104)
(20, 'Fortgeschrittenes Russisch', 'RUS', 'C1', 4, datetime.date(2020, 4, 8), 0, 5, 103)

Vamos deletar o curso com ID 20: course_id 20 - 'Fortgeschrittenes Russisch', usando a cl√°usula DELETE:

In [32]:
delete_course = """
DELETE FROM course WHERE course_id = 20;
"""

connection = create_db_connection("172.17.0.2", "root", pw, db)
execute_query(connection, delete_course)

MySQL Database connection successful
Query successful

Agora, vamos checar se o curso foi deletado:

In [33]:
q1 = """
SELECT *
FROM course;
"""

connection = create_db_connection("172.17.0.2", "root", pw, db)
results = read_query(connection, q1)

from_db = []

for result in results:
  print(result)

MySQL Database connection successful
(12, 'English for Logistics', 'ENG', 'A1', 10, datetime.date(2020, 2, 1), 1, 1, 105)
(13, 'Beginner English', 'ENG', 'A2', 40, datetime.date(2019, 11, 12), 0, 6, 101)
(14, 'Intermediate English', 'ENG', 'B2', 40, datetime.date(2019, 11, 12), 0, 6, 101)
(15, 'Advanced English', 'ENG', 'C1', 40, datetime.date(2019, 11, 12), 0, 6, 101)
(16, 'Mandarin f√ºr Autoindustrie', 'MAN', 'B1', 15, datetime.date(2020, 1, 15), 1, 3, 103)
(17, 'Fran√ßais interm√©diaire', 'FRA', 'B1', 18, datetime.date(2020, 4, 3), 0, 2, 101)
(18, 'Deutsch f√ºr Anf√§nger', 'DEU', 'A2', 8, datetime.date(2020, 2, 14), 1, 4, 102)
(19, 'Intermediate English', 'ENG', 'B2', 10, datetime.date(2020, 3, 29), 0, 1, 104)

### Restaurando o curso

In [34]:
restore_russian = """
INSERT INTO course VALUES
(20, 'Fortgeschrittenes Russisch', 'RUS', 'C1',  4, '2020-04-08',  FALSE, 5, 103);
"""

connection = create_db_connection("172.17.0.2", "root", pw, db)
execute_query(connection, restore_russian)


q1 = """
SELECT *
FROM course;
"""

connection = create_db_connection("172.17.0.2", "root", pw, db)
results = read_query(connection, q1)

from_db = []

for result in results:
  print(result)

MySQL Database connection successful
Query successful
MySQL Database connection successful
(12, 'English for Logistics', 'ENG', 'A1', 10, datetime.date(2020, 2, 1), 1, 1, 105)
(13, 'Beginner English', 'ENG', 'A2', 40, datetime.date(2019, 11, 12), 0, 6, 101)
(14, 'Intermediate English', 'ENG', 'B2', 40, datetime.date(2019, 11, 12), 0, 6, 101)
(15, 'Advanced English', 'ENG', 'C1', 40, datetime.date(2019, 11, 12), 0, 6, 101)
(16, 'Mandarin f√ºr Autoindustrie', 'MAN', 'B1', 15, datetime.date(2020, 1, 15), 1, 3, 103)
(17, 'Fran√ßais interm√©diaire', 'FRA', 'B1', 18, datetime.date(2020, 4, 3), 0, 2, 101)
(18, 'Deutsch f√ºr Anf√§nger', 'DEU', 'A2', 8, datetime.date(2020, 2, 14), 1, 4, 102)
(19, 'Intermediate English', 'ENG', 'B2', 10, datetime.date(2020, 3, 29), 0, 1, 104)
(20, 'Fortgeschrittenes Russisch', 'RUS', 'C1', 4, datetime.date(2020, 4, 8), 0, 5, 103)

Esse comando tamb√©m funciona para apagar colunas inteiras, usando [DROP COLUMN](https://www.w3schools.com/sql/sql_ref_drop_column.asp) e tabelas inteiras, usando [DROP TABLE](https://www.w3schools.com/sql/sql_ref_drop_table.asp) (ambos os textos de refer√™ncia em ingl√™s), mas n√£o abordaremos esses comandos neste tutorial.

No entanto, v√° em frente e experimente-os - n√£o importa se voc√™ excluir uma coluna ou tabela de um banco de dados para uma escola fict√≠cia. √â uma boa ideia se familiarizar com esses comandos antes de passar para um ambiente de produ√ß√£o.

### E o [CRUD](https://pt.wikipedia.org/wiki/CRUD)?

A essa altura, j√° podemos concluir as quatro opera√ß√µes principais para o armazenamento de dados persistentes.

Aprendemos a:

-   Create (Criar) - bancos de dados, tabelas e registros inteiramente novos
-   Read (Ler) - extrair dados de um banco de dados e armazenar em diversos formatos
-   Update (Atualizar) - fazer altera√ß√µes nos registros existentes no banco de dados
-   Delete (Apagar) - remover registros que n√£o s√£o mais necess√°rios

Poder fazer essas coisas √© incrivelmente √∫til.

Antes de concluirmos, temos mais uma habilidade muito importante para aprender.

# Criando registros a partir de listas

Vimos, ao preencher nossas tabelas, que podemos utilizar o comando SQL INSERT em nossa fun√ß√£o execute\_query para inserir registros em nosso banco de dados.

Dado que estamos usando Python para manipular nosso banco de dados SQL, seria √∫til poder obter uma estrutura de dados do Python, tal como uma [lista](https://www.w3schools.com/python/python_lists.asp) (texto em ingl√™s), e inseri-la diretamente em nosso banco de dados.

Isso pode ser √∫til quando queremos armazenar logs de atividade do usu√°rio em um aplicativo de m√≠dia social que escrevemos em Python ou entradas de usu√°rios em uma p√°gina Wiki que criamos, por exemplo. Existem tantos usos poss√≠veis para isso quantos voc√™ possa imaginar.

Esse m√©todo tamb√©m √© mais seguro se nosso banco de dados estiver aberto para nossos usu√°rios a qualquer momento, pois ajuda a prevenir ataques de [inje√ß√£o de SQL](https://pt.wikipedia.org/wiki/Inje%C3%A7%C3%A3o_de_SQL), que podem [danificar ou at√© destruir](https://www.lucidchart.com/pages/er-diagrams) (texto em ingl√™s) todo o nosso banco de dados.

Para fazer isso, escreveremos uma fun√ß√£o usando o m√©todo [executemany()](https://dev.mysql.com/doc/connector-python/en/connector-python-api-mysqlcursor-executemany.html), em vez do m√©todo [execute()](https://dev.mysql.com/doc/connector-python/en/connector-python-api-mysqlcursor-execute.html) (textos de refer√™ncia em ingl√™s), para aceitar mais um argumento.

In [35]:
def execute_list_query(connection, sql, val):
    cursor = connection.cursor()
    try:
        cursor.executemany(sql, val)
        connection.commit()
        print("Query successful")
    except Error as err:
        print(f"Error: '{err}'")

Agora que temos a fun√ß√£o, precisamos definir um comando SQL ('sql') e uma lista contendo os valores que desejamos inserir no banco de dados ('val'). Os valores devem ser armazenados em uma [lista](https://www.w3schools.com/python/python_lists.asp) de [tuplas](https://www.w3schools.com/python/python_tuples.asp) (textos de refer√™ncia em ingl√™s), que √© uma maneira bastante comum de armazenar dados em Python.

Para adicionar dois novos professores ao banco de dados, podemos escrever um c√≥digo como este:

### Adicionando Professores

In [36]:
sql = '''
    INSERT INTO teacher (teacher_id, first_name, last_name, language_1, language_2, dob, tax_id, phone_no) 
    VALUES (%s, %s, %s, %s, %s, %s, %s, %s)
    '''
val = [
    (7, 'Hank', 'Dodson', 'ENG', None, '1991-12-23', 11111, '+491772345678'), 
    (8, 'Sue', 'Perkins', 'MAN', 'ENG', '1976-02-02', 22222, '+491443456432')
]


connection = create_db_connection("172.17.0.2", "root", pw, db)
execute_list_query(connection, sql, val)

MySQL Database connection successful
Query successful

Observe aqui que no c√≥digo 'sql' usamos o '%s' como um espa√ßo reservado para nosso valor. A semelhan√ßa com o ['%s'](https://stackoverflow.com/questions/4288973/whats-the-difference-between-s-and-d-in-python-string-formatting/48660475) para uma string em Python √© apenas coincid√™ncia (e francamente, muito confusa), pois devemos usar '%s' para todos os tipos de dados (strings, inteiros, datas etc) com o MySQL Python Conector.

Voc√™ pode ver v√°rios casos no [Stackoverflow](https://stackoverflow.com/questions/20818155/not-all-parameters-were-used-in-the-sql-statement-python-mysql/20818201) em que algu√©m ficou confuso e tentou usar ['%d'](https://stackoverflow.com/questions/4288973/whats-the-difference-between-s-and-d-in-python-string-formatting/48660475) para inteiros porque estava acostumado a fazer isso em Python. Isso n√£o funcionar√° aqui - precisamos usar um '%s' para cada coluna para qual queremos adicionar um valor.

A fun√ß√£o executemany, ent√£o, pega cada tupla em nossa lista 'val' e insere o valor relevante para aquela coluna no lugar do espa√ßo reservado e executa o comando SQL para cada tupla contida na lista.

Isso pode ser feito para v√°rias linhas de dados, desde que sejam formatadas corretamente. Em nosso exemplo, adicionaremos apenas dois novos professores, para fins ilustrativos, mas em princ√≠pio podemos adicionar quantos quisermos.

Vamos executar este comando e adicionar os professores ao nosso banco de dados.

In [37]:
q1 = """
SELECT *
FROM teacher;
"""

connection = create_db_connection("172.17.0.2", "root", pw, db)
results = read_query(connection, q1)

from_db = []

for result in results:
  print(result)

MySQL Database connection successful
(1, 'James', 'Smith', 'ENG', None, datetime.date(1985, 4, 20), 12345, '+491774553676')
(2, 'Stefanie', 'Martin', 'FRA', None, datetime.date(1970, 2, 17), 23456, '+491234567890')
(3, 'Steve', 'Wang', 'MAN', 'ENG', datetime.date(1990, 11, 12), 34567, '+447840921333')
(4, 'Friederike', 'M√ºller-Rossi', 'DEU', 'ITA', datetime.date(1987, 7, 7), 45678, '+492345678901')
(5, 'Isobel', 'Ivanova', 'RUS', 'ENG', datetime.date(1963, 5, 30), 56789, '+491772635467')
(6, 'Niamh', 'Murphy', 'ENG', 'IRI', datetime.date(1995, 9, 8), 67890, '+491231231232')
(7, 'Hank', 'Dodson', 'ENG', None, datetime.date(1991, 12, 23), 11111, '+491772345678')
(8, 'Sue', 'Perkins', 'MAN', 'ENG', datetime.date(1976, 2, 2), 22222, '+491443456432')

Esta √© mais uma fun√ß√£o muito √∫til, permitindo-nos pegar dados gerados em nossos scripts e aplicativos Python e inseri-los diretamente em nosso banco de dados.